#include "Usart_Magagement.h"


/****************************私有宏定义*******************************/

/****************************私有函数声明*****************************/

/****************************私有全局变量定义*************************/

/****************************公有全局变量定义*************************/

/****************************私有函数*********************************/

/****************************公有函数*********************************/

/****************************************************************************
* 名    称：HAL_UART_TxCpltCallback
* 功    能：DMA串口发送完成中断回调函数 
* 入口参数：UART_HandleTypeDef *huart：串口参数结构体
* 出口参数：无
* 说    明：
* 调用方法：无 
****************************************************************************/ 
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)  
{  
  __HAL_DMA_DISABLE(huart->hdmatx);  
  
  /*******************************串口2发送回调**************************/
  if(huart->Instance == USART2)
  {
    Usart2_Data.usart2_tx_DMA_free = 0;//USART,串口2dma发送空闲标记清零
  }
  /*******************************串口1发送回调**************************/
  if(huart->Instance == USART1)
  {
    Usart1_Data.usart1_tx_DMA_free = 0;//USART,串口1dma发送空闲标记清零
  }
  
} 
